# Pandas

In [374]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [4]:
arr=[1,2,3,4]
arr

[1, 2, 3, 4]

In [49]:
#Series
ser1=pd.Series(arr,['a','b','c','d'])

#passing in list and labels for the series

In [30]:
ser1['d']

4

In [33]:
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [51]:
#DataFrame
# pd.DataFrame(<data>,<colm>) ShiftTab and check
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.161111 -1.493881 -1.028039  0.381516
B  1.227245  0.322398  0.373993  1.637636
C  0.037949  1.561078  0.031700 -1.046591
D -1.885209 -1.456267  0.222712 -1.552917
E -0.108442 -0.013938  0.797980  0.986391

In [121]:
#selecting Columns

df['W']

B    1.227245
C    0.037949
D   -1.885209
E   -0.108442
Name: W, dtype: float64

In [57]:
type(df['W'])

pandas.core.series.Series

In [67]:
df.W   #avoid calling colms using '.',instead use '[]'

A    0.161111
B    1.227245
C    0.037949
D   -1.885209
E   -0.108442
Name: W, dtype: float64

In [69]:
#creating new colums
df['new']=df['W']+df['X']
df

          W         X         Y         Z       new
A  0.161111 -1.493881 -1.028039  0.381516 -1.332770
B  1.227245  0.322398  0.373993  1.637636  1.549642
C  0.037949  1.561078  0.031700 -1.046591  1.599027
D -1.885209 -1.456267  0.222712 -1.552917 -3.341475
E -0.108442 -0.013938  0.797980  0.986391 -0.122380

In [109]:
#dropping columns

#df.drop('new',axis=1) #if axis not specified, default is 0, 
#       which refers to the index (A,B,C,D,E)
#Axis 0 is row and 1 is col, the .shape of this dataframe will be (5,4)
#       which indicates that 0th pos is 5(row) and 1st is 4(col)

In [105]:
#df.drop('A',inplace=True) #inplace makes the changes made perm

In [99]:
df

          W         X         Y         Z
B  1.227245  0.322398  0.373993  1.637636
C  0.037949  1.561078  0.031700 -1.046591
D -1.885209 -1.456267  0.222712 -1.552917
E -0.108442 -0.013938  0.797980  0.986391

### Selecting Rows 
 ##### 1.loc- location/label based
 ##### 2.iloc- index based

In [234]:
#Selecting Rows 
# 1.loc- location/label based 
# 2.iloc- index based 

#df.loc['B']

df.iloc[0]

In [133]:
df.loc[['C','B'],['X','Y']]  #subset selection

          X         Y
C  1.561078  0.031700
B  0.322398  0.373993

In [139]:
df[(df['W']>0) & (df['Z']>1)]  #& - and, | - or

          W         X         Y         Z
B  1.227245  0.322398  0.373993  1.637636

In [141]:
df.reset_index()

  index         W         X         Y         Z
0     B  1.227245  0.322398  0.373993  1.637636
1     C  0.037949  1.561078  0.031700 -1.046591
2     D -1.885209 -1.456267  0.222712 -1.552917
3     E -0.108442 -0.013938  0.797980  0.986391

In [143]:
df

          W         X         Y         Z
B  1.227245  0.322398  0.373993  1.637636
C  0.037949  1.561078  0.031700 -1.046591
D -1.885209 -1.456267  0.222712 -1.552917
E -0.108442 -0.013938  0.797980  0.986391

In [151]:
col='AC BC HB KJ'.split()
col

['AC', 'BC', 'HB', 'KJ']

In [155]:
df['States']=col
df

          W         X         Y         Z States
B  1.227245  0.322398  0.373993  1.637636     AC
C  0.037949  1.561078  0.031700 -1.046591     BC
D -1.885209 -1.456267  0.222712 -1.552917     HB
E -0.108442 -0.013938  0.797980  0.986391     KJ

In [171]:
#df.set_index('States')
df

               W         X         Y         Z
States
AC      1.227245  0.322398  0.373993  1.637636
BC      0.037949  1.561078  0.031700 -1.046591
HB     -1.885209 -1.456267  0.222712 -1.552917
KJ     -0.108442 -0.013938  0.797980  0.986391

### MultiLevel Indexing

In [183]:
#MultiLevel Indexing

outside='G1 G1 G1 G2 G2 G2'.split()
inside=[1,2,3,1,2,3]
heir_index=list(zip(outside,inside))
heir_index=pd.MultiIndex.from_tuples(heir_index)
outside
inside

[1, 2, 3, 1, 2, 3]

In [187]:
df= pd.DataFrame(randn(6,2),heir_index,['A','B'])

In [189]:
df

             A         B
G1 1  0.084735 -1.436546
   2  0.002868  1.702418
   3 -0.425522 -1.710665
G2 1 -0.317900  0.484702
   2  0.175841 -0.480123
   3 -1.242335  1.366070

In [191]:
df.index.names

FrozenList([None, None])

In [195]:
df.index.names=['Groups','Nums']
df

                    A         B
Groups Nums
G1     1     0.084735 -1.436546
       2     0.002868  1.702418
       3    -0.425522 -1.710665
G2     1    -0.317900  0.484702
       2     0.175841 -0.480123
       3    -1.242335  1.366070

In [199]:
df.loc['G2'].loc[2].loc['B']

-0.4801228181873067

In [205]:
df.xs(1,level='Nums')  #cross_section method for multi level indexing

               A         B
Groups
G1      0.084735 -1.436546
G2     -0.317900  0.484702

# Missing Data

##### dropna(_)
##### fillna(_)

In [220]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [222]:
df=d

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [245]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [247]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [258]:
df.fillna(value=df['A'].mean(),inplace=True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

### Groupby

In [264]:
df.groupby('A').describe().transpose()

A        1.0  1.5  2.0
B count  1.0  1.0  1.0
  mean   5.0  1.5  1.5
  std    NaN  NaN  NaN
  min    5.0  1.5  1.5
  25%    5.0  1.5  1.5
  50%    5.0  1.5  1.5
  75%    5.0  1.5  1.5
  max    5.0  1.5  1.5
C count  1.0  1.0  1.0
  mean   1.0  3.0  2.0
  std    NaN  NaN  NaN
  min    1.0  3.0  2.0
  25%    1.0  3.0  2.0
  50%    1.0  3.0  2.0
  75%    1.0  3.0  2.0
  max    1.0  3.0  2.0

In [268]:
df.groupby('A').value_counts()
df.groupby('A').max()

       B  C
A
1.0  5.0  1
1.5  1.5  3
2.0  1.5  2

##### **Concatenation**: pd.contact([df1,df2,df3]) 
##### **Merge**: pd.merge(left,right,how='inner',on='key')
##### **Join**: left.join(right)

## Operation

In [284]:
#unique()
#value_counts()

In [333]:
dat=[1, 4, 2, 6, 4, 3]
df=pd.DataFrame(data=dat)
df.rename(columns={0:'A'},inplace=True)

In [335]:
df

   A
0  1
1  4
2  2
3  6
4  4
5  3

In [337]:
def times(x):
    return x*2

In [345]:
df['A'].apply(times)

0     2
1     8
2     4
3    12
4     8
5     6
Name: A, dtype: int64

In [353]:
df['A'].apply(lambda x:x*200)

0     200
1     800
2     400
3    1200
4     800
5     600
Name: A, dtype: int64

In [362]:
df.drop('A',axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [366]:
df.sort_values('A')

   A
0  1
2  2
5  3
1  4
4  4
3  6

In [368]:
df.isnull()

       A
0  False
1  False
2  False
3  False
4  False
5  False

In [372]:
#pd.read_csv('_')
#pd.to_csv('_')
#pd.read_html('_')